{"Michael_Bennet": {"Current position": "Senator from Colorado - 10 years served", "Age": "54", "Born": "New Delhi, while his father was serving as an aide to then-U.S. ambassador to India", "Undergraduate": "Wesleyan University", "Date candidacy announced": "May 2, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 27.7%", "Previous roles": "Managing director for the Anschutz Investment Company, chief of staff to former Denver Mayor John Hickenlooper, and superintendent of Denver Public Schools.", "Criminal justice": "Bennet was a sponsor for the justice reform First Step Act bill in 2016, which limited juvenile solitary confinement and reduced minimum sentences for some repeat non-violent drug crimes.", "Climate change": "Bennet has been consistent on the issue of climate change, working toward a comprehensive approach to combat climate change. He was not a co-sponsor of the Green New Deal, but he recommends investing in renewable energy.", "Agriculture": "Bennet has been vocal in his criticism of Trump's tariffs on trade and agriculture. He said Trump's trade war is harming more farmers than it helps. Bennet was also a key advocate of the 2018 farm bill.", "Court packing": "Bennet reportedly slammed his head on a table when the Washington Post asked him about packing the Supreme Court.", "Medicare for All": "As part of a group of Democrats proposing \"more incremental steps to broaden health care coverage,\" rather than \"Medicare for All,\" Bennet and Sen. Tim Kaine proposed \"Medicare X,\" which would develop a public option modeled after Medicare alongside private options on the Affordable Care Act exchanges.", "Immigration": "Bennet co-signed a letter spearheaded by Sen. Kamala Harris to then-Homeland Security Secretary Kirstjen Nielsen, demanding that the Trump administration take immediate action to reunite 539 migrant children with their families. He has advocated for providing a pathway to citizenship for DACA recipients.", "Marijuana": "Bennet sponsored a bill in February to \"End Federal Prohibition of Marijuana.\"", "Taxes": "Bennet is a primary sponsor of the American Family Act, which would provide tax cuts for middle class families to help offset the cost of raising children in America.", "*Name recognition": "Bennet isn't exactly a household name, and he was the 21st candidate to enter the Democratic field for 2020.", "*Bank deregulation": "Bennet was part of a group of Senate Democrats that moved to deregulate banks, which garnered criticism from the more liberal wing of the party."}, "Joe_Biden": {"Age": "76", "Born": "Scranton, Pa.", "Undergraduate": "University of Delaware", "Date candidacy announced": "April 25, 2019", "Previous roles": "Vice president; U.S. senator from Delaware", "The cost of college": "\"Community college should be we free and we can afford it,\" Biden said at the Electrical Workers Conference in April. Biden also said he supported free tuition at state universities in 2015.", "Health care": "Biden has signaled that he is open to adding onto the Affordable Care Act, which was signed into law while he was vice president. \"The Affordable Care Act was a big step ... but we need to build on it. What we can't do is blow it up.\"", "Marijuana legalization": "He has a long history of being anti-marijuana, calling it a \"gateway drug.\" While vice president, Biden said that he supports decriminalization rather than legalization.", "Minimum wage": "In 2015, Biden called for a $12 federal minimum wage that would gradually increase to $15 by 2020, even when the Obama administration advocated for a modest uptick of $12 per hour from $7.25.", "Infrastructure": "He has suggested a general use of private and public funds to invest in federal infrastructure, saying the U.S. needs \"a massive commitment to rebuild our infrastructure.\"", "Climate change": "\"We need to face the facts that climate change is coming. It's not only a threat ... it's an opportunity,\" he said in April, referencing the creation of jobs around renewable energy initiatives.", "*Allegations of inappropriate touching": "7 woman have come forward - some in groups, some individually - to publicly address what they described as uncomfortable encounters or instances of inappropriate touching from Biden.", "*Criticism 2": "Biden issued a video statement in response to the allegations, saying he understands \"social norms are changing\" and \"the boundaries of protecting personal space have been reset,\" adding, \"I get it.\" He did not specifically issue an apology in the video.", "*Justice Clarence Thomas' Supreme Court confirmation": "The confirmation of Brett Kavanaugh last year, amid allegations of sexual assault, thrust Biden into a national debate over how he handled Thomas' confirmation in 1991. Thomas was also accused of sexual harassment by his former employee, Anita Hill. Biden, who chaired the Senate Judiciary Committee at the time, voted against Thomas, but was criticized for failing to defuse attacks against Hill.", "*The war on drugs and crime bills": "In January, Biden expressed regret for supporting tough-on-crime bills during his time in Congress, including a measure that established strict sentencing standards for crack and powder cocaine offenses, which experts say have led to an era of mass incarceration that disproportionately affected black Americans.", "*Integration": "He attempted to pass anti-busing legislation for school integration in the 1970s, a stance that has garnered renewed criticism. Biden said that, at the time, he believed in equal educational opportunities but was still against busing children or using quota systems as a way to achieve desegregation."}, "Cory_Booker": {"Current position": "Senator from New Jersey - 5 years served", "Age": "49", "Born": "Washington, D.C.", "Undergraduate": "Stanford (Rhodes Scholar)", "Date candidacy announced": "Feb. 1, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 15.4%", "Previous roles": "Newark, N.J. city council, mayor of Newark", "Criminal justice": "He has been a vocal proponent of reforming the criminal justice system. On March 7, Booker tweeted a proposal for a new bill with progressive ideas like further cutting mandatory minimums for nonviolent drug offenses and banning racial and religious profiling.", "Medicare for All": "Signed on as a co-sponsor.", "Green New Deal": "Signed on as a co-sponsor.", "Gun control": "Proposed a 14-part plan in May that calls for a national gun licensing program, which would force Americans to apply for 5-year gun licenses.", "Political finance": "Announced he won't take money from corporate PACs or federal lobbyists.", "Marijuana": "He reintroduced a bill on Feb. 28 that would legalize marijuana on the federal level and supersede the patchwork of 10 states (and Washington, D.C.) that have legalized recreational marijuana.", "Jobs": "His proposed jobs guarantee plan would establish a 3-year pilot program that gives 15 local areas funding to provide all residents a job paying at least $15 an hour.", "Baby bonds": "Proposed giving newborns savings accounts seeded with $1,000 to close the racial wealth gap.", "\"Rise Credit\"": "Proposed a policy aiming to expand eligibility for the Earned Income Tax Credit to more working and middle-class families.", "Voter rights": "If elected president, Booker plans to introduce a \"new Voting Rights Act\" to end gerrymandering, cut voter suppression, expand voting and registration.", "*Corporate interests": "Though he has recently changed his tune on corporate money, Booker was the top recipient of Wall Street money in the 2014 election cycle. He also has a reputation as a friend of the pharmaceutical industry as well as Silicon Valley.", "*Self-promotion": "He has been criticized as a grandstanding politician, highlighted by his \"I am Spartacus\" moment when he said he would jeopardize his Senate seat by releasing confidential documents during the Brett Kavanaugh confirmation hearings."}, "Pete_Buttigieg": {"Age": " 37", "Born": "South Bend, Indiana", "Undergraduate": "Harvard University (BA), Oxford University (BA)", "Date candidacy announced: ": "Announced on April 14, 2019 in South Bend. Announced his exploratory committee Jan. 23, 2019.", "Previous roles": " Mayor of South Bend, Indiana. Began serving in the U.S. Navy Reserve in 2009 and was deployed to Afghanistan in 2014. Previously worked for McKinsey & Company.", "College costs": "Has concerns about soaring student debt and believes college is too expensive for \"too many people.\" He supports expanding the Public Service Loan Forgiveness program that clears loans in exchange for public service work.", "Climate change": "Supports the Paris climate agreement and the Green New Deal, and he thinks climate change is a national security threat. He is supportive of government-subsidized solar panels.", "Capitalism": "Says he is a capitalist, but that democracy is \"more important\" than capitalism: \"If you want to see what happens when you have capitalism without democracy, you can see it very clearly in Russia.\"", "Guns": "He is a member of Mayors Against Illegal Guns and supports universal background checks and banning guns in schools.", "Health care": "Supports single-payer health care, but wants to transition to the model via an all-payer rate-setting, which would not eliminate private insurance companies.", "Immigration": "Buttigieg supports providing a pathway to citizenship for Dreamers, a local network. When speaking on Meet the Press about making South Bend a \"welcoming city\" for immigrants, Buttigieg said ICE is \"tearing families apart.\"", "Discrimination": "He supports updating the Civil Rights Act of 1964 to explicitly apply non-discrimination protections to the LGBTQ community.", "Abortion": "Said on Meet the Press that abortion is a \"question that is almost unknowable ... a moral question that is not going to be settled by science. So the best way for it to be settled in practice is by the person who actually faces the choice.\"", "Supreme Court": "Proposed having a 15-justice court with 5 Democratic appointees, 5 Republican appointees and 5 selected by agreement of the other 10 justices.", "Electoral college": "Supportive of abolishing it.", "Vaccines": "Initially said he believes in personal/religious exemptions to vaccines when there is no public health crisis. But after criticism on Twitter, his campaign reeled back his statement: \"There is no evidence that vaccines are unsafe, and he believes children should be immunized to protect their health.\"", "*Youth": "Buttigieg says being a millennial candidate would be a benefit, rather than a hurdle. He contends he has more of a \"personal appreciation\" for student debt as well as the stakes of climate change.", "*Accepted donations from lobbyists": "After taking criticism for accepting money from powerful Washington lobbyists, Buttigieg backed off and announced he would return the donations he had received.", "*Police recordings": "Buttigieg demoted his police chief and fired the police communications director for illegally recording police officers' phone calls that allegedly revealed officers making racist comments."}, "Julian_Castro": {"Current position": "n/a", "Age": "44", "Born": "San Antonio", "Undergraduate": "Stanford University", "Date candidacy announced": "Jan. 12, 2019", "Previous roles": "Obama's Secretary of Housing and Urban Development, Mayor of San Antonio, Member of San Antonio City Council", "Housing": "As HUD Secretary, one of Castro's main project included ConnectHome - an initiative that brought internet accessibility to those who lived in HUD-assisted housing in 28 communities.", "Medicare for All": "He supports it, saying at an event with Iowa Democrats that the U.S. should \"be the healthiest nation,\" per the Hill.", "Universal pre-K": "As mayor, Castro proposed Prek4SA, a universal pre-K program, in exchange for an eighth-cent sales tax increase, per the Washington Post. Castro wants to expand universal pre-K to the entire country.", "Immigration": "In a Medium post, Castro outlined his extensive immigration policy, which includes reversing Trump policies such as the Muslim ban, spending on a southern border wall and cuts to refugee programs. Castro proposed a 21st Century Marshall Plan for Central America to focus on stabilizing the countries with the largest number of migrants coming to the U.S.", "Abortion": "\"I believe in a woman's right to choose, it is an issue of reproductive freedom and justice,\" he said at She the People Presidential Forum in Houston on April 24.", "*Anonymity": "Castro has a lower profile compared to some of the other Democrats who have thrown their names in the ring for president, admitting he isn't a \"frontrunner in this race.\"", "*Progressive backlash": "As HUD secretary, Castro faced criticism from a group of progressives - many of whom supported then-2016 candidate Bernie Sanders - over his handling of mortgage sales, Politico reported at the time. The groups launched a website called DontSellOurHomesToWallStreet.org."}, "John_Delaney": {"Current position": "n/a", "Age": "55", "Born": "Wood-Ridge, New Jersey", "Undergraduate": "Columbia University", "Date candidacy announced": "July 28, 2017", "% of votes in line with Trump": "per FiveThirtyEight: 34.4%", "Previous roles": "Representative for Maryland's 6th district, co-founder and CEO of CapitalSource, co-founder and CEO of Health Care Financial Partners", "Gerrymandering": "As a congressman, Delaney introduced the Open Our Democracy Act, legislation aimed at ending gerrymandering and establishing Election Day as a federal holiday.", "Health care": "In an interview with CNBC, Delaney said he supports creating a universal health care system, but not Medicare for All.", "Universal pre-K": "He supports providing universal pre-K, free community college and career and technical training.", "Automation and artificial intelligence": "While in Congress, Delaney founded the AI caucus and authored legislation to create an advisory committee on AI's impact in the workforce. He has called for policies that seek to address job loss due to AI and automation.", "Minimum wage": "He supports raising the federal minimum wage to $15.", "Carbon tax": "Last November, Delaney co-sponsored a bipartisan bill that looked to impose an initial $15-per-ton carbon \"fee\" on fossil fuel producers, processors and importers. Per Axios' Ben Geman, the plan had no chance of becoming law.", "*Anonymity": "Delaney has a lower profile than many of the other Democratic candidates running for president, despite already being in the race for over a year."}, "Tulsi_Gabbard": {"Current position": "Congresswoman from Hawaii since 2013", "Age": "37", "Born": "Leloaloa, American Samoa", "Undergraduate": "Hawaii Pacific University", "% of votes in line with Trump": "per FiveThirtyEight: 21.7%", "Previous roles": "Hawaii state legislature, Hawaii Army National Guard, Senate legislative aide, Honolulu City Council", "Green New Deal": "No stated position, but proposed a bill in 2017 to transition to 100% renewable energy to generate electricity by 2035.", "Medicare For All": "Supports. Said that she doesn't want to eliminate private insurance.", "Education": "She wants to get rid of tuition and fees at 4-year public colleges and universities. She also supports free community college tuition for everyone.", "Also Sanders-esque": "She has spoken about reducing the role of money in politics and has called for a reduced military presence in the Middle East.", "*Syrian President Bashar al-Assad meeting": "In what her office called a \"fact-finding\" mission, Gabbard made a secret trip to Syria in January 2017 and met with Assad. There are questions about the Arab American organization that funded the trip. She has also met with Egyptian President Abdel Fattah el-Sisi.", "*Her LGBTQ record": "When she was young, she worked for her father's anti-gay organization, and when running for state legislature in 2002, she talked up her support for her father's efforts to ban same-sex marriage in Hawaii. She has since apologized, saying that those positions were a result of her conservative upbringing.", "*\"Extreme vetting\" vote": "She voted with congressional Republicans on an Obama-era bill that would place \"extreme vetting\" measures on Iraqi and Syrian refugees."}, "Kirsten_Gillibrand": {"Current position": "Senator from New York - 10 years served", "Age": "52", "Born": "Albany, New York", "Undergraduate": "Dartmouth", "Date candidacy announced": "March 17 (exploratory committee announcement on Jan. 15)", "% of votes in line with Trump": "per FiveThirtyEight: 11.7% (lowest of any senator)", "Previous roles": "U.S. Representative (NY-20), corporate attorney, worked for 2000 Hillary Clinton Senate campaign", "Sexual assault": "Gillibrand has been one of the leading voices in Congress on #MeToo. In 2013, she introduced the Military Justice Improvement Act to reform how sexual assault complaints are handled in the U.S. military justice system and chain of command. She has also called for colleges and universities to reform how they handle sexual assault cases.", "Medicare for All": "Co-sponsored.", "Green New Deal": "Voiced strong support.", "Gun control": "As a representative, she was an advocate for gun rights and had an 'A' rating from the NRA. But since joining the Senate, she has made an about-face and is now a vocal proponent of stricter gun control laws.", "Campaign finance": "Proposed a plan where eligible voters would opt into a \"Democracy Dollars\" program for campaign fundraising. Voters would get $200 in vouchers for each federal race, provided by the Federal Elections Commission (FEC).", "Tax returns": "Became the first 2020 candidate to release her 2018 tax returns and called on her opponents to do the same.", "Immigration": "Supports comprehensive immigration reform - has suggested eliminating and reimagining ICE.", "Abortion": "Gillibrand pledged in a Medium post that if she were elected president, she would only nominate judges that will uphold Roe v. Wade and protect reproductive rights: \"A woman’s right to make her own personal health decisions is nonnegotiable,\" she wrote.", "*Conservative track record": "During her time as a member of the conservative Democrats Blue Dog Coalition when she represented New York's 20th district, Gillibrand had an 'A' rating from the NRA and opposed amnesty for undocumented immigrants.", "*Al Franken": "Some Democrats are upset that Gillibrand moved to oust Franken from the Senate without a public hearing.", "*Staff sexual harassment": "One of Gillibrand's staffers resigned over the handling of a sexual harassment complaint against one of the senator's closest aides, showing her office to be at odds with her public persona as a champion of sexual harassment victims."}, "Kamala_Harris": {"Current position": "Senator from California - 2 years served", "Age": "54", "Born": "Oakland", "Undergraduate": "Howard University", "Date candidacy announced": "Jan. 21, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 17.0%", "Previous roles": "California Attorney General (2011-2017), San Francisco District Attorney (2004-2011), prosecutor", "Green New Deal": "She's among the list of 2020 hopefuls who signed on as a co-sponsor of the bill.", "Medicare for All": "She co-sponsored Sen. Bernie Sanders' bill.", "Marijuana legalization": "She's declared her support for legalizing marijuana at the federal level, admitting in an interview that she had smoked a joint \"a long time ago.\"  Signed on as a cosponsor of Cory Booker's Marijuana Justice Act to legalize weed at the federal level.", "Teacher pay": "Announced in March a plan to give the average teacher a $13,500 salary increase, which would cost an estimated $315 billion over 10 years.", "Taxes": "Last October, she introduced the LIFT the Middle Class Act which, Vox's Dylan Matthews explains, was basically an expansion of the earned income tax credit. Earlier that year, she proposed the Rent Relief Act, which would offer tax credits to help with rents.", "Sex work": "Harris told The Root that she supports decriminalizing sex work, saying \"we can't criminalize consensual behavior as long as no one is being harmed.\"", "Death penalty": "Harris has called for a national moratorium on the death penalty.", "*Criticism 1": "Harris has faced criticism because of cases she argued and policies she put in place as California's attorney general.", "*Criticism 2": "She defended the death penalty as attorney general, despite being personally against it.", "*Criticism 3": "She stayed silent on a number of criminal justice reforms championed by progressives.", "*Criticism 4": "She didn't take a position on California Proposition 47, which was approved by voters, that reduced some felonies to misdemeanors.", "*Criticism 5": "She opposed a bill that would've required her office to investigate police shootings."}, "John_Hickenlooper": {"Current position": "n/a - 2-term governor of Colorado until Jan. 8, 2019", "Age": "67", "Born": "Narberth, Pennsylvania", "Undergraduate": "Wesleyan University", "Date candidacy announced": "March 4, 2019", "Previous roles": "Governor of Colorado, mayor of Denver, restaurant and brewery owner, geologist", "Gun control": "Signed legislation to require background checks for all gun sales and a ban on high-capacity magazines.", "Health care": "Created an Affordable Care Act exchange for Colorado and opted to expand Medicaid.", "Economy": "Was known as a pro-business governor, working to slim down the state's regulatory environment. He also worked to bring companies to Denver, created an apprentice program for high schoolers and launched a website to retrain displaced workers.", "Marijuana": "Once opposed to the idea of legalization in Colorado, he has come around to it.", "Medicare for All": "Said he supports single-payer health care, advocating for the general idea rather than hastily hashing out a specific policy. He opposed a ballot measure to bring a publicly-financed health care system to Colorado.", "Green New Deal": "Wrote an op-ed in March denouncing the proposal, arguing that while he supports the \"concept\" of sweeping resolution to fight climate change, the Green New Deal \"sets unachievable goals\" and would inflate the government.", "*Big change": "Per the Denver Post: Some wonder \"whether the cautious, consensus-building approach that has marked his governorship is too timid for the national stage.\"", "*Moderation": "Many feel moderation and nuance is not a winning formula for 2020 Democrats.", "*Ethics complaint": "Alleged to have violated Colorado rules by accepting free jet rides.", "*Business-friendly": "Pro-business agenda included being an outspoken supporter of the fracking industry."}, "Jay_Inslee": {"Current position": "Governor of Washington - 9 years served. Chair of the Democratic Governors Association.", "Age": "68", "Born": "Seattle, Washington", "Undergraduate": "Stanford University, University of Washington", "Date candidacy announced": "March 1, 2019", "Previous roles": "House of Representatives (1993-1995, 1999-2012), Washington House of Representatives (1989-1993)", "Climate change": "In March at a renewable energy industry event, Inslee cited several measures enacted or proposed in his state and elsewhere around electric vehicle targets, a clean transportation fuels standard, \"net-zero\" buildings, and more.", "Green New Deal": "Inslee places more emphasis on the role of the private sector than some advocates of the GND, although he praises the concept. Inslee told the Washington Post he \"welcomes\" the GND, but says it's not endorsable since it's not yet an actual policy.", "Capitalism": "Inslee is signaling the ways in which he's closer to Sen. Elizabeth Warren's reformist view of capitalism than to the democratic socialism of Rep. Alexandria Ocasio-Cortez and Sen. Bernie Sanders.", "Gun control": "In 1994, Inslee voted in favor of federal legislation that banned the manufacture, sale and possession of combat-style assault weapons, a stance that probably cost him his House seat in 1995, CNBC reports. Today, he still has strong views on gun control - touting that his state stands up for \"common sense gun safety reforms.\"", "Senate filibuster": "\"I don't believe you can really be serious about saying you are going to defeat climate change unless you realize that we need to have the filibuster go the way of history,” he told reporters.", "Vaccinations": "Inslee declared a state of emergency in January after the anti-vaccination wave contributed to cases of measles, causing what he called a \"public disaster.\"", "*Anonymity": "Inslee isn't a nationally recognized name in a very crowded Democratic race. In his defense, he told the Seattle Times that Jimmy Carter and Bill Clinton \"were pretty much unknown governors of small states\" before they ran for president.", "*Age": "A recent poll found 43 of Iowa's 76 Democratic county party leaders say they want a young candidate to be their nominee."}, "Amy_Klobuchar": {"Current position": "Senator from Minnesota  - 12 years served", "Age": "58", "Born": "Plymouth, Minnesota", "Undergraduate": "Yale University", "Date candidacy announced": "Feb. 10, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 30.8%", "Previous roles": "Hennepin County attorney, corporate lawyer", "Infrastructure": "Klobuchar introduced a trillion-dollar policy rollout on March 28 that would use federal funds and tax subsidies to update the country's infrastructure. The policy would also reinstate the Obama administration’s recession-era “Build America Bonds,” which provides state governments with a 35 percent subsidy to offset borrowing costs, per the NYT. Klobuchar's campaign described infrastructure as the candidate's \"top budget priority.\"", "Health care": "She is one of two Democratic presidential candidates who signed a letter backing Medicare Advantage, the growing alternative to traditional Medicare.", "Mental health": "She released a $100 billion plan to combat mental health problems and substance abuse over the next decade. Her plan focuses on prevention, treatment and ongoing recovery. Klobuchar wants a chunk of the money to come from opioid manufacturers for their role in the national epidemic.", "Climate change": "She's one of the backers of Rep. Alexandria Ocasio-Cortez's Green New Deal. In her campaign announcement, she also mentioned ambitious goals for climate legislation.", "Criminal justice": "Klobuchar supported the bipartisan First Step Act, a reform of the federal prison system, in the Senate.", "Drug pricing": "She urged the Federal Trade Commission to crack down on \"pay-for-delay\" pharmaceutical deals.", "Sexual harassment": "Klobuchar successfully pushed for legislation mandating sexual harassment training in the Senate.", "Data privacy": "She sponsored a bill that proposed regulations for Facebook's data practices. She also was the lead sponsor of legislation that would regulate online political ads.", "Opioids": "She co-sponsored a bill that would impose a one-cent tax for each milligram of opioids in a pain pill. The funds for the tax would then be used for substance abuse treatment.", "*Staff treatment": "Multiple media outlets have detailed Klobuchar's alleged history of emotionally abusive treatment of her staff.", "*Pragmatism": "Klobuchar hasn't embraced parts of progressive agenda - including on Medicare for All and free college - like many of her fellow 2020 Democratic hopefuls.", "*\"Minnesota Nice\"": "A recent New York Times article asks whether a \"calm, reasoned, reliable (but not flashy) Democrat\" like Klobuchar is what the party needs to fight President Trump."}, "Wayne_Messam": {"Current position": "Mayor of Miramar, Fla., since 2015", "Miramar": "City in the Miami metropolitan area, pop. 122,041", "Age": " 44", "Born": " South Bay, Fla.", "Undergraduate": "Florida State University", "Date candidacy announced: ": "March 28, 2019", "Previous roles": " President of the National Black Caucus of Local Elected Officials; elected to the Miramar City Commission in 2011; former vice chair of Miramar's Planning and Zoning Board; licensed as a General Contractor, and owner of a construction business, Asset Builders, focused on environmentally friendly projects.", "Gun safety": "Messam has worked to enact local gun regulations in Miramar to make a 5,000-seat amphitheater in the city gun-free. He, along with 5 other mayors, sued Florida Gov. Rick Scott last year to eliminate a state law that penalizes local officials if they enact municipal gun regulations.", "Climate change": "Messam signed a letter that criticized President Trump for his plan to withdraw the U.S. from the Paris Climate Accord.", "Student loan debt forgiveness": "Messam plans to announce a policy proposal this weekend.", "Resolving the student debt crisis": "Before tackling college affordability, Messam wants to provide relief for the nearly \"one-in-four\" American adults up against ongoing student loan payments. He has proposed a one-time, in-full federal government debt cancellation plan, in which borrowers would receive confirmation that their debt was forgiven within 60 days. Messam sees the $1. 5 trillion plan - which would be paid for in part by rescinding the 2017 tax cut package - as \"a strong stimulus to a stalling economy.\"", "*Local politicians": "rarely make it to the White House, and another mayor who has already announced his candidacy, Mayor Pete Buttigieg of South Bend, Indiana, has a larger national profile than Messam, in part due to his 2017 bid to head up the Democratic National Committee.", "*He has little": "fundraising experience.", "*He was under investigation": "for an inaccurate campaign report during his 2015 bid for the mayoral seat by the Florida Elections Commission."}, "Seth_Moulton": {"Current position": "U.S. Representative for Massachusetts' 6th congressional district since 2015, member of the House Subcommittee on Strategic Forces", "Age": "40", "Born": "Salem, Mass.", "Undergraduate": "Harvard University", "Date candidacy announced": "April 22, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 19.0%", "Previous roles": "Four tours with the Marine Corps during the Iraq War, managing director of transportation firm Texas Central Railway, co-founded now-defunct Eastern Healthcare Partners", "National security": "\"I recognize that the polling doesn’t have national security as a top issue right now, but it’s not just the right thing to do for the country with this reckless commander in chief - it’s also a political opportunity for Democrats because the Republicans have given us an unbelievable opening with Donald Trump in the Oval Office,\" he said in an interview with Defense One.", "Defense": "\"You won’t find a stronger advocate for having very clear missions and an end-game that troops know they can achieve to get home,\" he told Defense One. \"But you also won’t find a stronger advocate for making clear to the rest of the world that America is a strong country and we will stand up for our national interests and our allies around the globe.\"", "Taxes": "\"We need a new tax code in this country. And it shouldn’t put the rich and powerful ahead of the rest of us,\" he tweeted in response to an article on Trump’s 2017 tax bill.", "Abortion": "He supports the public funding of abortions and the right for women to terminate pregnancy for health reasons. He opposes the \"Born-Alive\" bill.", "Gun control": "He supports universal background checks for gun buyers. \"Congress has the ability and authority to eliminate the civilian sale of weapons of war. We have before, and we should again,\" his website reads. He has tweeted support for the March For Our Lives movement.", "Renewable energy": "He signed a 2016 initiative for the U.S. to use 50% clean and carbon-free electricity by 2030.", "*Notoriety": "Moulton is less nationally known than many other candidates in the Democratic field, but he did gain headlines for championing the campaign to remove Nancy Pelosi as Speaker of the House during the 2018 midterms."}, "Beto_O'Rourke": {"Age": " 46", "Born": " El Paso, Texas", "Undergraduate": "Columbia University", "Date candidacy announced: ": "March 14, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 30.1%", "Previous roles": " Representative for Texas' 16th congressional district for 3 terms, served on El Paso City Council 2005–2011", "Medicare for All": "O’Rourke supports universal health care but did not mention", "Climate change": "In April, he proposed an aggressive, detailed $5 trillion plan to address climate change, calling it the \"greatest threat we face.\" It aims for net-zero carbon emissions by 2050.", "Taxes": "He has derided business tax cuts and opposed the GOP tax overhaul of 2017. O’Rourke voted in favor of an oil tax in 2016 that would have taxed $10 on every barrel of crude oil.", "Gun control": "O'Rourke has called for universal background checks and limits on the sale of AR-15s. He opposes requiring states to recognize concealed carry permits granted in other states.", "Immigration": "O'Rourke has been a vocal critic of Trump's border wall with Mexico and said the U.S. should not criminalize who request asylum between ports of entry.", "Supreme Court reform": "Said on March 14 that \"an idea we should explore\" is to have 5 justices selected by Democrats and 5 by Republicans - those 10 would then select five more per side for a total of 20. He also offered the idea of term limits for Supreme Court justices.", "College tuition": "He is not on the bill for debt-free college.", "Minimum wage": "O'Rourke supports increasing the minimum wage to $15 per hour.", "Marijuana": "He is in favor of decriminalization and expunging criminal records of cannabis-related offenses.", "Transparency": "O'Rourke said he would require his Cabinet to hold monthly town hall meetings.", "Big Tech": "O'Rourke doesn't support breaking up Big Tech firms like Amazon, saying such action would do little to \"ensure dynamism in our economy and address corporate concentration.\" Instead, he suggested the Federal Trade Commission should focus on smaller corporations that are likely to go unnoticed.", "*Lack of progressive policy": "Democratic activists question whether O'Rourke is truly progressive enough to clinch the nomination. He was a member of the New Democrat Coalition in the House of Representatives, which aligned itself closely with business interests.", "*Energy policy": "O'Rourke has opposed legislation that would prevent drilling in the eastern Gulf of Mexico.", "*Business policy": "He has voted in favor of bills that Democrats said would reduce independent audits of corporations.", "*Lack of solutions": "O'Rourke has criticized Trump's border wall approach to immigration, but has not offered concrete policy solutions and said in an interview with the Washington Post that he didn't know what could be done about immigrants who overstay their visa.", "*Behavior in his teenage years": "When he was 15 years old he wrote a piece of fiction about killing children. Since announcing his run, he has expressed embarrassment about the piece: \"I’m mortified to read it now, incredibly embarrassed, but I have to take ownership of my words. ... and I have to constantly try to do better.\"", "*Hacking": "O'Rourke was a member of America's oldest hacking group, Cult of the Dead Cow, in the 1980s, in which he was known as \"Psychic Warlord.\""}, "Tim_Ryan": {"Current position": "U.S. Representative for Ohio's 13th congressional district since 2003, member of the House Appropriations Committee", "Age": "45", "Born": "Niles, Ohio", "Undergraduate": "Youngstown State University (1991-1992), Bowling Green State University (graduated 1995)", "Date candidacy announced": "April 4", "% of votes in line with Trump": "per FiveThirtyEight: 19.6%", "Previous roles": "He served as a representative for the 17th district in Ohio from 2003-2013, which is technically the same as his current district - it was renumbered in 2013. Ryan previously worked as a staffer for Ohio Rep. Jim Traficant. He served half a term in the Ohio State Senate from 2000-2002.", "Taxes": "Ryan does not support cutting taxes. On The View, he said tax cuts \"have been the answer for everything since 1980. And what's happened since 1980? Average wages have been stagnant, health care costs have gone up.\"", "Renewable energy": "He wants the U.S. to harness the economic benefits of renewables. \"There's so many industries out there growing. Wind and solar is growing at 25% to 30% a year. By 2030, there's gonna be 30 million electric vehicles. I want those vehicles made in the United States. I want the batteries made in the United States. I want the charging stations made in the United States.\"", "Agriculture": "Ryan has a book called \"The Real Food Revolution\" on the need for what he calls \"a new kind of food system - family farm, 21st-century style.\" It's reminiscent of Michelle Obama's programs in support of nutritious food, even though those programs were largely focused on children and school programs.", "Retirement": "He wants to \"restore the dignity of a secure retirement.\"", "Health care": "Ryan has supported single-payer health care and the Affordable Care Act, he said in a Face the Nation interview in April.", "*Leadership tussles": "Ryan challenged Nancy Pelosi for the House Minority Leader position in 2016 and suggested someone else be House Speaker for this congressional class. Critics have said his opposition has been a \"publicity stunt.\"", "*Flip-flopping on key Democratic issues": "", "*Abortion": "Ryan previously opposed abortion based on his Catholic faith (and voted for the amendment that would prevent taxpayer dollars from funding them), but he announced his change of opinion in an op-ed in The Akron Beacon Journal in 2015. He said he now thinks “we must trust women and families - not politicians - to make the best decision for their lives.”", "*Gun control: Ryan": "previously received A-ratings from the National Rifle Association, but following the fatal Las Vegas shooting in 2017, he announced he would donate the $20,000 he’d received from the NRA’s PAC to organizations that support of gun control."}, "Bernie_Sanders": {"Current position": "Senator from Vermont - 12 years served", "Age": "77", "Born": "Brooklyn, New York", "Undergraduate": "Brooklyn College, University of Chicago", "Date candidacy announced": "Feb. 19, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 14.4%", "Previous roles": "House Representative for Vermont's at-large congressional district, Mayor of Burlington, Vermont.", "Medicare For All": "Sanders spearheaded a sweeping Medicare for All plan, which he introduced in 2017.", "Green New Deal": "Sanders is a co-sponsor of the bill and has spoken consistently about the severity of climate change.", "Taxes": "Sanders has long said he supports raising taxes on the wealthiest Americans. He recently proposed hiking estate taxes for millionaires and billionaires, including a top rate of 77% for estates over $1 billion.", "Minimum wage": "Sanders co-sponsored a bill in April 2017 that would raise the federal minimum wage to $15. In September 2018, he introduced the Stop Bad Employers by Zeroing Out Subsidies (Stop BEZOS) Act, which would tax companies for public benefits their workers accessed.", "Voting rights": "Says felons should be allowed to vote while in prison.", "College tuition": "A key point of Sanders' 2016 presidential run was his proposal to make public college tuition free and debt free.", "Marijuana": "He co-sponsored fellow 2020 presidential candidate Sen. Cory Booker's recently reintroduced Marijuana Justice Act, that would legalize marijuana on the federal level.", "Agriculture": "Sanders rolled out a proposal to help revitalize rural farming communities and break up big agriculture corporations. The comprehensive plan would enact \"Roosevelt style trust-busting laws,\" address climate change and propose job training and education for farmers.", "*Socialism": "That he's too far left. Or that the party has moved past him and he is no longer the only potential candidate who can carry the \"progressive\" label.", "*Campaign staff sexual misconduct": "Sanders' 2016 presidential campaign was plagued by patterns of sexism and inappropriate behavior among members.", "*Age": "A recent poll found 43 of Iowa's 76 Democratic county party leaders say they want a young candidate to be their nominee for president in 2020.", "*Lack of loyalty": "Despite running for president as a Democrat in 2016, Sanders has always identified as an independent and has said he won't join the party.", "*Pragmatism": "Many of Sanders' proposals would need high levels of government spending, creating questions about how feasible some of them actually are."}, "Eric_Swalwell": {"Age": "38", "Born": " Sac City, Iowa", "Education": "University of Maryland College Park (BA), University of Maryland Baltimore (JD)", "Date candidacy announced: ": "April 8, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 19.5%", "Previous roles": " 4 terms in Congress. Sits on the House Intelligence Committee. Chairman of the Intelligence Modernization and Readiness subcommittee.", "Gun safety": "Plans for it to be his No. 1 issue on the campaign trail. During his first 100 days in office, Swalwell says he will push for a ban on military-style semi-automatic assault weapons. He also wants to enact a federal buyback of all 15 million assault weapons in the U.S.", "Climate change": "\"Most Americans agree that to address climate chaos, to make sure your house doesn't end up underwater or on fire, we should do something about it but make sure we're not pitting workers against their job,\" Swalwell said in his campaign video. He said he's supportive of the principles of the Green New Deal.", "Health care": "Wants large sums of pubic money to find cures to Alzheimer's, cancer and ALS.", "College tuition": "Proposes no-interest federal student loans and tax-free employer contributions. He also supports debt-free college for public university students in exchange for a work-study and pledge to better their communities after graduation.", "Press freedom": "Swalwell has helped introduce and re-introduce this year the Journalist Protection Act, which would make it a federal crime for certain attacks on those who work in the media.", "Social security": "In office, he has said he wanted to raise the cap on the Social Security payroll tax so the wealthy pay more into the program.", "Trump-Russia": "He believes President Trump, the president's family and his team colluded with Russia. He said on ABC Tuesday morning that Trump \"acts on Russia’s behalf too often.\"", "*Notoriety": "Swalwell is less nationally known than several other candidates.", "*One-issue campaign": "Swalwell is going all in on gun control, which could appear as a one-dimensional campaign while other key 2020 issues are on the table.", "*A crowded pool": "Swalwell will be the 18th person running for the Democratic nomination."}, "Elizabeth_Warren": {"Current position": "Senator from Massachusetts - 6 years served", "Age": "69", "Born": "Oklahoma City", "Undergraduate": "University of Houston", "Date candidacy announced": "Feb. 9, 2019", "% of votes in line with Trump": "per FiveThirtyEight: 13.2%", "Previous roles": "Law professor; member of Congressional Oversight Panel monitoring the $700 billion TARP bank bailout program; named by President Obama to be a special adviser for the Consumer Financial Protection Bureau.", "Wealth tax": "She proposed a 2% tax on wealth beyond $50 million and a 3% tax on wealth above $1 billion.", "Green New Deal": "Signed on as a co-sponsor of the proposal, after previously expressing support for the \"idea\" of the GND.", "College debt": "Proposed a plan in April to eliminate $640 billion in student debt, funded by her wealth tax proposal. The plan would also include universal free public college.", "Medicare For All": "Co-sponsored Bernie Sanders' bill in September 2017.", "Capitalism": "Said she identifies as a \"Democrat capitalist,\" rather than a \"democratic socialist.\" She told Pod Save America she sees \"the value of markets and that they can produce a lot of good if they have rules.\"", "Big Tech": "Proposed in March a plan to break up Google, Facebook and Amazon. It would prohibit companies with over $25 billion in revenue to act as operators and users of a platform and would install regulators to break up already-closed mergers.", "Corporate tax": "Proposed in April a new 7% tax on companies' profits over $100 million.", "Marijuana": "Signed on as a cosponsor of Cory Booker's Marijuana Justice Act to legalize weed at the federal level.", "Electoral college": "Said in March she would support a plan to replace the electoral college with a national popular vote.", "Punishment for scams": "Proposed expanded criminal liability, including jail time for any executive \"who negligently oversees a giant company causing severe harm to U.S. families.\"", "Public lands": "Proposed a plan to require 10% of electricity generation to come from renewable sources located offshore or on public lands and that would unlock 50% of currently inaccessible federally owned land for public use. The proposal also includes an executive order that would end drilling offshore and on public lands.", "Opioid crisis": "Proposed a $100 billion plan over the next 10 years to fund first responders, public health departments and states for prevention and rehabilitation services. Warren fired shots at Big Pharma and Congress for choosing \"greed\" over the best interest of the American public.", "*Criticism 1": "Warren has taken heat for her claims of Native American heritage. She commissioned a DNA test in the fall of 2018 to prove she had Cherokee ancestry, which she later apologized for. In February, the Washington Post unearthed a State Bar of Texas registration card in which she listed her race as American Indian.", "*Criticism 2": "President Trump has seized on this issue, frequently pointing it out whenever he mentions her, and referring to Warren as \"Pocahontas.\""}, "Marianne_Williamson": {"Current position": "Spiritual leader, author and activist", "Age": "66", "Born": "Houston", "Undergraduate": "Pomona College (left after 2 years)", "Date candidacy announced": "January 28, 2019", "Previous roles": "In 2014, Williamson ran as an independent in California's 33rd district congressional race and placed fourth out of 16 candidates, winning 13.2% of the vote.", "Health care": "Supports a \"Medicare for All model,\" according to her campaign website.", "Education": "Supports universal pre-school and free college.", "Green New Deal": "Supports.", "Immigration": "She supports DACA and a full path to citizenship for undocumented immigrants with no \"serious criminal background.\"", "Israeli-Palestinian peace process": "\"I don’t think the ultimate answer will be about settlements or checkpoints,” Williamson told a Jewish news site. \"The work of the genuine peace builders must be on the level of the heart.” She added that the U.S. must return to \"where it can be considered an honest broker\" to play a useful role.", "Reparations": "In an interview with CNN, Williamson called for $100 billion to be paid to African Americans in reparations for slavery, with $10 billion per year distributed over 10 years.", "*Staff treatment": "In a 1992 article, Williamson was criticized for her interpersonal skills and management style - a claim she acknowledged she could work on. At the time, she referred to herself as \"the bitch for God.\"", "*Anonymity and inexperience": "Williamson has never held public office before and has less name-recognition than many of her 2020 competitors."}, "Andrew_Yang": {"Current position": "n/a", "Age": "44", "Born": "Schenectady, New York", "Undergraduate": "Brown University", "Date candidacy announced": "November 6, 2017", "Previous roles": "Founder of Venture for America, Manhattan Prep CEO, Stargiving.com VP, corporate attorney at Davis Polk & Wardwell", "Universal basic income": "Yang's proposal - \"The Freedom Dividend\" - would provide every American over 18 years old with $1,000 per month. He contends that this would grow the economy by 13 percent and increase the labor force by 4.5-5 million people. This policy stems from his belief that AI and automation will wipe out millions of jobs, and that UBI is the path to avoiding economic ruin.", "Medicare for All": "Yang advocates for a single-payer health care system.", "Economy": "Yang calls his economic philosophy \"human-centered capitalism,\" advocating for a system that emphasizes metrics that measure \"human well-being and fulfillment,\" such as standard of living, health-adjusted life expectancy, childhood success rate and social and economic mobility. He described his plans as a \"vision for a trickle-up economy\" on ABC's This Week.", "Marijuana legalization": "Yang pledged to legalize marijuana and pardon all non-violent drug related offenses, then later clarified in an interview with George Stephanopoulos that he would only pardon marijuana-related offenses. Yang said he would still decriminalize opioids.", "Social media": "Yang has proposed a federal department to oversee social media, citing \"a huge surge in depression, anxiety, and emotional issues\" on ABC's This Week. He described it as \"a Department of the Attention Economy.\"", "Circumcision": "In March, Yang came out against circumcision, telling the Daily Beast: \"I’m highly aligned with the intactivists. History will prove them even more correct..From what I’ve seen, the evidence on it being a positive health choice for the infant is quite shaky.\"", "*Anonymity": "Yang is not well-known and will struggle to drive the conversation.", "*Inexperience": "He has not worked in government before."}}